/*******************************************************************************
長方形の縦と横の長さを入力し、アスタリスクを使って長方形を出力する。
---例---
縦＝＝＞5
横＝＝＞10
**********
**********
**********
**********
**********

********************************************************************************/
#include <stdio.h>

int main(void) {
  int tate, yoko, i, j;

  printf("縦＝＝＞");
  scanf("%d", &tate);
  printf("横＝＝＞");
  scanf("%d", &yoko);

  for (i = 0; i < tate; i++) {
    for ( j = 0; j < yoko; j++) {
      printf("*");
    }
    printf("\n");
  }
  return 0;
}
