/*******************************************************************************
2〜100までの整数のうち、素数を出力する。
素数:2以上の整数で、1とその数以外で割り切れない数のこと。
********************************************************************************/
#include <stdio.h>

int main (void){
  int i = 2;
  int j = 2;
  int yakusuu = 0;

  for(i = 2;i <= 100; i++){
    yakusuu = 0;
    for(j = 2;j <= 100; j++){

      if(i%j == 0){
        yakusuu += 1;
      }

    }

    if(yakusuu < 2){
      printf("%d ", i);
    }

  }
  printf("\n");
  return 0;
}
